## Staging
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 6 to add, 3 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                 RESOURCE                                  |
|--------|---------------------------------------------------------------------------|
| add    | `aws_cloudwatch_log_metric_filter.superset_ecs_warnings[&quot;celery-beat&quot;]`   |
|        | `aws_cloudwatch_log_metric_filter.superset_ecs_warnings[&quot;celery-worker&quot;]` |
|        | `aws_cloudwatch_log_metric_filter.superset_ecs_warnings[&quot;superset&quot;]`      |
|        | `aws_cloudwatch_metric_alarm.superset_ecs_warnings[&quot;celery-beat&quot;]`        |
|        | `aws_cloudwatch_metric_alarm.superset_ecs_warnings[&quot;celery-worker&quot;]`      |
|        | `aws_cloudwatch_metric_alarm.superset_ecs_warnings[&quot;superset&quot;]`           |
| update | `aws_cloudwatch_log_metric_filter.superset_ecs_errors[&quot;celery-beat&quot;]`     |
|        | `aws_cloudwatch_log_metric_filter.superset_ecs_errors[&quot;celery-worker&quot;]`   |
|        | `aws_cloudwatch_log_metric_filter.superset_ecs_errors[&quot;superset&quot;]`        |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_cloudwatch_log_metric_filter.superset_ecs_errors["celery-beat"] will be updated in-place
  ~ resource "aws_cloudwatch_log_metric_filter" "superset_ecs_errors" {
        id             = "celery-beat-error"
        name           = "celery-beat-error"
      ~ pattern        = "[(w1=\"*CRITICAL*\" || w1=\"*ERROR*\") && w1!=\"*'Template' object has no attribute 'strip'*\" && w1!=\"*AccessDenied*GENERIC_DB_ENGINE_ERROR*\" && w1!=\"*COLUMN_NOT_FOUND*\" && w1!=\"*contains non-numeric values*\" && w1!=\"*DML_NOT_ALLOWED_ERROR*\" && w1!=\"*Error on OAuth authorize*\" && w1!=\"*Failed to execute query*\" && w1!=\"*Insufficient permissions to execute the query*\" && w1!=\"*Only `SELECT` statements are allowed*\" && w1!=\"*SYNTAX_ERROR*\"]" -> "[(w1=\"*CRITICAL*\" || w1=\"*ERROR*\") && w1!=\"*'Template' object has no attribute 'strip'*\" && w1!=\"*AccessDenied*GENERIC_DB_ENGINE_ERROR*\" && w1!=\"*COLUMN_NOT_FOUND*\" && w1!=\"*contains non-numeric values*\" && w1!=\"*DML_NOT_ALLOWED_ERROR*\" && w1!=\"*Error on OAuth authorize*\" && w1!=\"*Error warming up cache*\" && w1!=\"*Failed to execute query*\" && w1!=\"*Insufficient permissions to execute the query*\" && w1!=\"*Only `SELECT` statements are allowed*\" && w1!=\"*SYNTAX_ERROR*\" && w1!=\"*TABLE_DOES_NOT_EXIST_ERROR*\"]"
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # aws_cloudwatch_log_metric_filter.superset_ecs_errors["celery-worker"] will be updated in-place
  ~ resource "aws_cloudwatch_log_metric_filter" "superset_ecs_errors" {
        id             = "celery-worker-error"
        name           = "celery-worker-error"
      ~ pattern        = "[(w1=\"*CRITICAL*\" || w1=\"*ERROR*\") && w1!=\"*'Template' object has no attribute 'strip'*\" && w1!=\"*AccessDenied*GENERIC_DB_ENGINE_ERROR*\" && w1!=\"*COLUMN_NOT_FOUND*\" && w1!=\"*contains non-numeric values*\" && w1!=\"*DML_NOT_ALLOWED_ERROR*\" && w1!=\"*Error on OAuth authorize*\" && w1!=\"*Failed to execute query*\" && w1!=\"*Insufficient permissions to execute the query*\" && w1!=\"*Only `SELECT` statements are allowed*\" && w1!=\"*SYNTAX_ERROR*\"]" -> "[(w1=\"*CRITICAL*\" || w1=\"*ERROR*\") && w1!=\"*'Template' object has no attribute 'strip'*\" && w1!=\"*AccessDenied*GENERIC_DB_ENGINE_ERROR*\" && w1!=\"*COLUMN_NOT_FOUND*\" && w1!=\"*contains non-numeric values*\" && w1!=\"*DML_NOT_ALLOWED_ERROR*\" && w1!=\"*Error on OAuth authorize*\" && w1!=\"*Error warming up cache*\" && w1!=\"*Failed to execute query*\" && w1!=\"*Insufficient permissions to execute the query*\" && w1!=\"*Only `SELECT` statements are allowed*\" && w1!=\"*SYNTAX_ERROR*\" && w1!=\"*TABLE_DOES_NOT_EXIST_ERROR*\"]"
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # aws_cloudwatch_log_metric_filter.superset_ecs_errors["superset"] will be updated in-place
  ~ resource "aws_cloudwatch_log_metric_filter" "superset_ecs_errors" {
        id             = "superset-error"
        name           = "superset-error"
      ~ pattern        = "[(w1=\"*CRITICAL*\" || w1=\"*ERROR*\") && w1!=\"*'Template' object has no attribute 'strip'*\" && w1!=\"*AccessDenied*GENERIC_DB_ENGINE_ERROR*\" && w1!=\"*COLUMN_NOT_FOUND*\" && w1!=\"*contains non-numeric values*\" && w1!=\"*DML_NOT_ALLOWED_ERROR*\" && w1!=\"*Error on OAuth authorize*\" && w1!=\"*Failed to execute query*\" && w1!=\"*Insufficient permissions to execute the query*\" && w1!=\"*Only `SELECT` statements are allowed*\" && w1!=\"*SYNTAX_ERROR*\"]" -> "[(w1=\"*CRITICAL*\" || w1=\"*ERROR*\") && w1!=\"*'Template' object has no attribute 'strip'*\" && w1!=\"*AccessDenied*GENERIC_DB_ENGINE_ERROR*\" && w1!=\"*COLUMN_NOT_FOUND*\" && w1!=\"*contains non-numeric values*\" && w1!=\"*DML_NOT_ALLOWED_ERROR*\" && w1!=\"*Error on OAuth authorize*\" && w1!=\"*Error warming up cache*\" && w1!=\"*Failed to execute query*\" && w1!=\"*Insufficient permissions to execute the query*\" && w1!=\"*Only `SELECT` statements are allowed*\" && w1!=\"*SYNTAX_ERROR*\" && w1!=\"*TABLE_DOES_NOT_EXIST_ERROR*\"]"
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # aws_cloudwatch_log_metric_filter.superset_ecs_warnings["celery-beat"] will be created
  + resource "aws_cloudwatch_log_metric_filter" "superset_ecs_warnings" {
      + id             = (known after apply)
      + log_group_name = "/aws/ecs/superset/celery-beat"
      + name           = "celery-beat-warning"
      + pattern        = "[(w1=\"*Error warming up cache*\")]"

      + metric_transformation {
          + default_value = "0"
          + name          = "celery-beat-warning"
          + namespace     = "superset"
          + unit          = "None"
          + value         = "1"
        }
    }

  # aws_cloudwatch_log_metric_filter.superset_ecs_warnings["celery-worker"] will be created
  + resource "aws_cloudwatch_log_metric_filter" "superset_ecs_warnings" {
      + id             = (known after apply)
      + log_group_name = "/aws/ecs/superset/celery-worker"
      + name           = "celery-worker-warning"
      + pattern        = "[(w1=\"*Error warming up cache*\")]"

      + metric_transformation {
          + default_value = "0"
          + name          = "celery-worker-warning"
          + namespace     = "superset"
          + unit          = "None"
          + value         = "1"
        }
    }

  # aws_cloudwatch_log_metric_filter.superset_ecs_warnings["superset"] will be created
  + resource "aws_cloudwatch_log_metric_filter" "superset_ecs_warnings" {
      + id             = (known after apply)
      + log_group_name = "/aws/ecs/superset/superset"
      + name           = "superset-warning"
      + pattern        = "[(w1=\"*Error warming up cache*\")]"

      + metric_transformation {
          + default_value = "0"
          + name          = "superset-warning"
          + namespace     = "superset"
          + unit          = "None"
          + value         = "1"
        }
    }

  # aws_cloudwatch_metric_alarm.superset_ecs_warnings["celery-beat"] will be created
  + resource "aws_cloudwatch_metric_alarm" "superset_ecs_warnings" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:257394494478:cloudwatch-alert-warning",
        ]
      + alarm_description                     = "`celery-beat` warnings logged over 1 day."
      + alarm_name                            = "warnings-celery-beat"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "celery-beat-warning"
      + namespace                             = "superset"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:257394494478:cloudwatch-alert-ok",
        ]
      + period                                = 86400
      + statistic                             = "Sum"
      + tags                                  = {
          + "CostCentre" = "cds-superset-staging"
          + "Terraform"  = "true"
        }
      + tags_all                              = {
          + "CostCentre" = "cds-superset-staging"
          + "Terraform"  = "true"
        }
      + threshold                             = 3
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.superset_ecs_warnings["celery-worker"] will be created
  + resource "aws_cloudwatch_metric_alarm" "superset_ecs_warnings" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:257394494478:cloudwatch-alert-warning",
        ]
      + alarm_description                     = "`celery-worker` warnings logged over 1 day."
      + alarm_name                            = "warnings-celery-worker"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "celery-worker-warning"
      + namespace                             = "superset"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:257394494478:cloudwatch-alert-ok",
        ]
      + period                                = 86400
      + statistic                             = "Sum"
      + tags                                  = {
          + "CostCentre" = "cds-superset-staging"
          + "Terraform"  = "true"
        }
      + tags_all                              = {
          + "CostCentre" = "cds-superset-staging"
          + "Terraform"  = "true"
        }
      + threshold                             = 3
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.superset_ecs_warnings["superset"] will be created
  + resource "aws_cloudwatch_metric_alarm" "superset_ecs_warnings" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:257394494478:cloudwatch-alert-warning",
        ]
      + alarm_description                     = "`superset` warnings logged over 1 day."
      + alarm_name                            = "warnings-superset"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "superset-warning"
      + namespace                             = "superset"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:257394494478:cloudwatch-alert-ok",
        ]
      + period                                = 86400
      + statistic                             = "Sum"
      + tags                                  = {
          + "CostCentre" = "cds-superset-staging"
          + "Terraform"  = "true"
        }
      + tags_all                              = {
          + "CostCentre" = "cds-superset-staging"
          + "Terraform"  = "true"
        }
      + threshold                             = 3
      + treat_missing_data                    = "notBreaching"
    }

Plan: 6 to add, 3 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.athena_bucket.aws_s3_bucket.this,
  on .terraform/modules/athena_bucket/S3/main.tf line 8, in resource "aws_s3_bucket" "this":
   8: resource "aws_s3_bucket" "this" {

lifecycle_rule is deprecated. Use the aws_s3_bucket_lifecycle_configuration
resource instead.

(and 2 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_athena_data_catalog.data_lake"]
WARN - plan.json - main - Missing Common Tags: ["aws_elasticache_subnet_group.superset"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.superset_waf_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_kinesis_firehose_delivery_stream.superset_waf_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_wafv2_regex_pattern_set.label_sizerestrictions_body_excluded_paths"]

24 tests, 19 passed, 5 warnings, 0 failures, 0 exceptions

```

</details>
